{
    "data": [
        {
            "id": "1554471698401214464",
            "text": "Welcome home, Hobby Lobby.   \nClergy sue over Florida abortion law, say it violates religious freedom https://t.co/9DxNsWIW5v"
        },
        {
            "id": "1554471695414706180",
            "text": "#PA Mixed up Mastriano keeps changing his campaign strategy.\nAbortion/No Abortion\nAntisemitic/Not Antisemitic\nHis platform is simple; he doesn't care about you.\nHe doesn't care about #Pennsylvania. \nNo one can believe him.\nNo one can trust him.\nNo one. https://t.co/aZZKjknfoc"
        },
        {
            "id": "1554471693640470531",
            "text": "Another Indication Radical Right-Wingers Know They are Overreaching &amp; Unpopular: Kansans Getting Phony Texts To Trick Them Into Voting Against Abortion Rights https://t.co/6DmttQJpR0 via @TPM"
        },
        {
            "id": "1554471690205364225",
            "text": "@CTACatholics calls themselves Catholic while promoting abortion. We live in clown world where anyone can call themselves whatever they like regardless of the truth"
        },
        {
            "id": "1554471635964534790",
            "text": "Remember, voting “yes” today means the legislature to regulate abortion as they please.\n\nWhen asked what they would do…nothing. Just “protect the life”. Of whom?"
        },
        {
            "id": "1554471633225646080",
            "text": "@NicoleC76490319 @Waistedlove444 @pawfecthouse And that doesn’t count the ones that were murdered through abortion."
        },
        {
            "id": "1554471628305833984",
            "text": "@MagicByWest @ImWatson91 @zoeykaylaa @KatyMontgomerie @KonstantinKisin Wow, some feminists don't talk about abortion ALL the time. How dare those pesky women choose what to concentrate their campaigning on? How dare Cervical Cancer research NOT include prostate cancer? \nYou don't even bother to hide your #misogyny"
        },
        {
            "id": "1554471615592861697",
            "text": "Kansas Amendment 2: The state’s constitutional abortion amendment, explained\nhttps://t.co/SfKu4S2UBi"
        },
        {
            "id": "1554471607866892288",
            "text": "@Chale333 @SauveShari Are pro-lifers/those who are anti-abortion imposing their views?"
        },
        {
            "id": "1554471601550364672",
            "text": "Addison Bell is testifying. She's the niece of Becky Bell, an Indiana teenager who died in 1988 after receiving an illegal abortion reportedly because of Indiana's restrictive parental consent law.\n\nBell's case become famous."
        }
    ],
    "meta": {
        "newest_id": "1554471698401214464",
        "oldest_id": "1554471601550364672",
        "result_count": 10,
        "next_token": "b26v89c19zqg8o3fpz5lsxfc82rkc1xmvylssz5m9he2l"
    }
}