{"data": [{"id": "1554484022234988544", "text": "Court ruling will allow county prosecutors to criminally charge providers for abortion https://t.co/MO9pMUBvWP via @michiganadvance"}, {"id": "1554484014295162880", "text": "@LauraRBelin @AnnieLowrey Why would you not think those things would be covered under exceptions?  Heck, even Planned Parenthood used to admit that things like resolving ectopic pregnancies are not considered abortion."}, {"id": "1554484013280071680", "text": "@RepMaryMiller The Dems could propose a bill that banned abortion, cut taxes down to nothing, deregulated all industry, and declared Trump king, and you’d still vote against it"}, {"id": "1554484009907982344", "text": "@SarahWW @micaiah157 @KatMcKinley Except that's not true since every state with an abortion ban allows treatment."}, {"id": "1554484009413001216", "text": "Between “woke” dems shitting on conservative states when they’re dealing with a disaster and more total abortion bans going into affect — my Twitter feed is so depressing."}, {"id": "1554484008377094146", "text": "another day, more stupid anti-abortion crowd. \nyou’re arguments are invalid. and i will show you with the bible i found left on a gas station pump - that’s how much people care about your religion lmao"}, {"id": "1554483995555106816", "text": "@Who_MeKitty @BeckyLeeBrenne1 @lslosier I’ve never seen women so eager to get pregnant with the sole intention of getting an abortion! Then they get mad at us!"}, {"id": "1554483989280223232", "text": "@DavidWohl @latimes What year are you in?  Newsom beat a recall.  He signed legislation to make California a safe haven for women seeking abortion. He's pushing CA for more aggressive climate action.  🌊"}, {"id": "1554483974021545989", "text": "This horrible ruling puts Kentucky’s extreme ban back into effect with no exceptions for rape or incest. We must continue to protect the healthcare rights of those seeking abortion services. AND, we must Vote No on Amendment #2 in November. https://t.co/AfIbiI6F2O"}, {"id": "1554483973824430081", "text": "@RobertH45332765 @HugBug702 @LilaGraceRose I have 2 kids never paid child support because my kids always lived with me. I’m a Dad that’s my job. My job isn’t to get women pregnant and then have them get a abortion so I can save some money"}], "meta": {"newest_id": "1554484022234988544", "oldest_id": "1554483973824430081", "result_count": 10, "next_token": "b26v89c19zqg8o3fpz5lsxfn3k14yglms9jkv6aetnon1"}}