{"data": [{"id": "1554504671380664321", "text": "@capeandcowell No one is outlawing contraception. Abortion is not illegal in most states.  These people are insane."}, {"id": "1554504670512553985", "text": "Come on, Kansas! DEMOCRATS NEED TO TURN PUT AND SAVE ABORTION IN KANSAS!!! https://t.co/nbYA69hMKV"}, {"id": "1554504662572847108", "text": "Religious leaders sue over Florida abortion law signed by Ron DeSantis - The Washington Post https://t.co/WUajEDLrjx"}, {"id": "1554504658151956482", "text": "Who just became the first city in the Southeast to allocate public funds towards abortion care? Atlanta! We did that! https://t.co/1q86BoM0be"}, {"id": "1554504638170275846", "text": "7 out of 10 Missourians support access to safe and legal abortion.\n\nYou’re not going to “build back the ranks of Democrats” by supporting anti-choice candidates."}, {"id": "1554504623972573186", "text": "\"We don't have the purview at the local level to of course legalize abortion. However, we do have the ability to limit our resources what will be spent or used to investigate, prosecute and uphold the legislation that has come from a state level,\" said CM Adam Bazaldua."}, {"id": "1554504602485231616", "text": "Pro-life doctors challenge threat to certification over abortion ‘misinformation’ https://t.co/rRdRAGjF7E"}, {"id": "1554504585749811200", "text": "@VotersTomorrow @ClaudetteGGibs1 Kansas having abortion vote. Hoping it's a huge turnout!!"}, {"id": "1554504585695268864", "text": "@N0t_My_Bu5iness However, I thought you were using yourself as an example/an argument supporting people who do abort because they worry their child’s life will not “good” due to many reasons  including “a sense of loss” I’m unsure how abortion could be better than adoption in any senario. 2/#"}, {"id": "1554504582952271878", "text": "@SummFlowers_ @MichaelGazard @TaritaC @PoliticsInsider Abortion is still legal in many states. Abortion is murder. Thanks for stopping by. https://t.co/SMnHGwP7ex"}, {"id": "1554504573208887303", "text": "@vixmcintyre @mirandaisrisen @momanoms2 @KristanHawkins Regulations are good. But regulations are opposed by prochoice advocates. His arrest showed that he was allowed to carry on his crimes in horrible conditions for decades because health inspectors were pressured not to investigate abortion clinics by pro choice advocates."}, {"id": "1554504568028930055", "text": "The Senate, which just narrowly passed the bill, would have to sign off on whatever changes the House makes to Senate Bill 1. https://t.co/EeSnAOqxaP"}, {"id": "1554504552467943424", "text": "truthfully, i don't care at all about all that political theatre. i want abortion rights, my analyses to work, bbq pork baos, and abs. in that order."}, {"id": "1554504541043048448", "text": "Today, I go to vote down a ballot measure that will make abortion care and fertility treatments illegal in the state of Kansas. I expect it to pass but I will vote anyway. \n\nIt feels hopeless and stupid. I hate it here. #VoteNo https://t.co/0W4soI3HPT"}, {"id": "1554504540354797569", "text": "@ChristineDrazan hi mrs drazan. im norway brazil at 33242 sunset beach lane #T warrenton OR 97146. u should be against abortion and against all gunlaws. u should create laws banning guns from felons and dangerous criminals in laws. u should be endorsed by trumps kardashians"}, {"id": "1554504531702079489", "text": "@knobetter @Middleclasswgs @ClayTravis banning abortion violates womens reproductive rights &amp; criminalizing it, their due process rights, so constitution\n\nAs for the effect of the failed ERA: unequal treatment in employment, education, insurance policies, health care, Social Security benefits, and other areas"}, {"id": "1554504524076818432", "text": "@amyklobuchar It’s not anti abortion- it’s pro full control of women. This proves it."}, {"id": "1554504523498110977", "text": "@Minkiemom17 @jerseygal72 @glimmer517 You are totally wrapped around the axel.\n\nI’m a woman, and I’ve made that clear to you several times over the last few days. I’ve told you I’ve been pregnant several times and have never once wanted or gotten an abortion.\n\nSo, yeah, getting a vasectomy isn’t on my priority list."}, {"id": "1554504498231578626", "text": "Angry abortion supporter attacks pro-life teen canvasser ahead of Kansas vote https://t.co/tFCamOAZYj"}, {"id": "1554504495215902720", "text": "https://t.co/OdQdu8BWKw"}, {"id": "1554504490216087553", "text": "it’s the first day of my birth and abortion doula training :-)"}, {"id": "1554504484688101376", "text": "@WHO Why not just have an abortion ?"}, {"id": "1554504482221764608", "text": "Liberals Vowed to End Charity Status for 'Dishonest' Anti-Abortion Groups. They Haven't  via @TheTyee https://t.co/kvBjDoYvU7"}, {"id": "1554504479764094983", "text": "@0liviajulianna Have you ever watched a fetus being dismembered?\n\nThat's abortion sweetie!"}, {"id": "1554504479550095360", "text": "@EvolvedGuppy @tiredofbsgal @Booker4KY No it’s representative democracy literally at work. We vote on the the representatives to fight for our values on our behalf and they enact laws. Overwhelming majority of Kentuckians are against abortion."}, {"id": "1554504476144218113", "text": "I own an abortion clinic called \"Don't Kid Yourself\""}, {"id": "1554504466908426240", "text": "@SusieLeeNV Abortion, Guns, Abortion, Guns, that is all Lee has to run on after 4 yrs in Congress, no results or accomplishments. Just 15% Inflation in NV, $5 a gal gas, Baby Formula Shortage, &amp; now she will vote to raise your taxes in Schumers latest Build Back Broke bill. Vote Lee Out."}, {"id": "1554504440052432896", "text": "Why the language on the Kansas abortion ballot is so confusing \n\n(FYI: Yes = Ban, No = Abortion Rights continue)\n\nhttps://t.co/9iCds3ui6s"}, {"id": "1554504434432020483", "text": "@Cordelia_K_ @GeneChurch1776 @Bambertolina @womensmarch Yes it's a medical term but still completely different than surgical or medical abortion. Trying to make them similar shows ignorance in science."}, {"id": "1554504433630908420", "text": "Clergy sue over Florida abortion law, say it violates religious freedom https://t.co/TmzSndgtSH"}, {"id": "1554504420599250946", "text": "\"Much of [CPCs' funding] comes from public funding, which these centers can access more easily than abortion clinics, which face a number of regulatory hurdles.\" https://t.co/WVXZQqibAp"}, {"id": "1554504418825060354", "text": "NEW from @NCRP -&gt;\n\n\"Crisis Pregnancy Centers receive 5x more funding than legitimate abortion clinics, according to research from the @ncrp. Even in states where abortion is protected, CPCs receive 1.5x more funding than actual clinics.\" https://t.co/WVXZQqibAp"}, {"id": "1554504417025695744", "text": "@Kansans4Freedom A soul is NEVER lost as a result of #abortion.\nA soul is lost due to failure to believe and ACT upon truth even if it makes one uncomfortable.\nMEDDLING like murderer, thief, evildoer is a SIN &amp; must be renounced.\n1 Peter 4:15\nOBSESSION with girls' uteruses = IDOLATRY.\nExodus 20:3 https://t.co/eDUk7mldkT"}, {"id": "1554504416052527104", "text": "I just read this second chance slow burn romance that was so so good! I love second chance so much and this one handled the abortion really well. Definitely recommend! https://t.co/utlUrOiRoJ"}, {"id": "1554504414139805696", "text": "Indiana House proposes new changes to Senate’s abortion ban https://t.co/c5YBYUOV7W"}, {"id": "1554504412759990275", "text": "The fact Hosmer is owed $39 mil still is baffling. One season with an OPS over .850/one season with wRC+ over 110 in 5 years and both were 2020.  Doesnt count.  He fucking stinks.  What an abortion of a contract for SD"}, {"id": "1554504394141564928", "text": "\"The most offensive and countercultural claim in Christianity isn't what Christians believe about homosexuality or abortion, marriage or religious liberty. . . The most offensive claim . . . is that God is the Creator, Owner, and Judge of every person on the planet\" - David Platt"}, {"id": "1554504393600290817", "text": "Our cause this ep is again @abortionfunds Collective Power Fund. It supports abortion funding to 28 member abortion funds across 20+ states. Directly funding: Costs of an abortion, Transportation to a clinic, Childcare, Lodging, Abortion doula support\nhttps://t.co/dkwZ8sVaro"}, {"id": "1554504384096124934", "text": "She survived an abortion by God’s Grace. What did she feel when Roe was struck down? , by @toddeherman https://t.co/4bnZgz4Vdj"}, {"id": "1554504381143437312", "text": "Thanks for signing, ⁦@ifyoucantwell⁩ ! https://t.co/TpQun0w1kq"}, {"id": "1554504368711409664", "text": "@itsallariddle @RadFemme74 @Mary_E_Mo @SafeFromRobots @MollyRomping @effityjeffity @MarthaKelly3 Bc all you’ve been able to offer up so far is periods and babies. If that’s what women are… it’s like… you hear it right? You hear that you have the exact same position as the people who want to stop abortion, keep women poor and pregnant, and think they control women’s bodies"}, {"id": "1554504366618513412", "text": "@J_TheExplorer @notabrokenthing @DorotheaBrooke8 @rgsrwwatch @StudentsforLife And no one is expecting you to pay with your body just because you did a completely legal action. Things happen but that doesn't mean we have to continue with them. I fully support you never having an abortion because I would never tell anyone what to do with their body"}, {"id": "1554504361551601664", "text": "@cafreeland Why has this not happened?\n\nLiberals Vowed to End Charity Status for 'Dishonest' Anti-Abortion Groups. They Haven't  via @TheTyee https://t.co/W0saVL3FaO"}, {"id": "1554504359769169922", "text": "It’s a weird world to live in where you start arguing before the facts are out.\n\nThe DOJ is the federal government, all new abortion laws are state laws. \n\nLuckily, the states never control federal property or regulations. https://t.co/7cpSiV1jUk https://t.co/9r8MEZ2kgi"}, {"id": "1554504354417229825", "text": "@trussliz @Conservatives Bollox\n\nABORTION\nWhy did you remove the text from the treaty on womens right to choose?\nAutonomy over their own bodies.?\n\nWhy?\n\nAnswer\n\nhttps://t.co/QZm3nQEqd3"}, {"id": "1554504349891452930", "text": "@DouthatNYT @politicalmath Are you just going to pretend this didn't happen?\n\nhttps://t.co/KM2Qehg0Fs"}, {"id": "1554504349107232769", "text": "@johnaddams2022 @FoxNews If the fetus is dead, it's not an abortion. It's a miscarriage. And no one is advocating forcing a woman to carry a dead baby."}, {"id": "1554504332002869249", "text": "some people say Can states limit abortion and gender-affirming treatments outside their borders?"}, {"id": "1554504323224281090", "text": "America should heed the suffering caused by El Salvador’s abortion ban https://t.co/pWlovyEfts"}, {"id": "1554504320539799552", "text": "Ideological war on new minds:\n\nKill them before they are born with an abortion.\n\nIf born, indoctrinate them with Critical Race Theory in schools.\n\nDuring puberty, mutilate them with pride poison.\n\nIn universities, brainwash them with DIE propaganda.\n\n#CRT #CriticalRaceTheory"}, {"id": "1554504312482455553", "text": "What will red states do to families who leave the state for an abortion and don’t come back?"}, {"id": "1554504307390701570", "text": "https://t.co/09hmcbmj6g\n#RoeVWade #abortions \nThis is crazy what they said. To think 13-year girls that are pregnant shouldn't be a negative thing. That is so sick to say that."}, {"id": "1554504276965314560", "text": "@spazgirl11 @RebeccaCokley @Eman_Rimawi @WNYC Can we start with it’s a cis man speaking to this issue? Has he ever had to stop meds due to harm to the fetus? Has he ever been denied meds because they may cause abortion and he is of child bearing age? Ugh!!!"}, {"id": "1554504269839073289", "text": "Pro-life doctors are poised to take legal action against a national medical board after it threatened the certification status of physicians who promote \"misinformation and disinformation\" about abortion.Source: https://t.co/ZIdUTcuMok  #ENMNEWSHEALTH\n\nhttps://t.co/xSIZhYxoIj https://t.co/Ao7ciAqxLM"}, {"id": "1554504263342010368", "text": "\"The mobile clinics, which provide contraception in addition to abortion care, are also bulletproof.\"\nhttps://t.co/3IhVXBp8jA"}, {"id": "1554504261530263552", "text": "@amyklobuchar The bill also promoted abortion and abortion funding that is why the republicans voted against it."}, {"id": "1554504257088495618", "text": "@JillFilipovic Also as you point out, illegal  abortion isn’t punished in PA as it is in MO or TX."}, {"id": "1554504256933208064", "text": "The City of Dallas could soon join other Texas cities in guarding the right to abortion care. This comes after Roe vs. Wade was overturned.\n\nThere's a resolution being considered today at a committee meeting at 3:30 p.m. I'll be following for @keranews: https://t.co/QfCpxFD3ZE"}, {"id": "1554504255167516675", "text": "@amyklobuchar And a good way to eliminate need for abortion?  May be they are in the illegal abortion business? First making abortion illegal, next take away one’s means to avoid abortion to create business!"}, {"id": "1554504253682733059", "text": "@AbbyJohnson \"God\" should mind his own business on an issue that Pro-Life claims isn't a religious one. Just shows that the religious right is playing a shell game over the reasons for anti-abortion legislation. Shell games are dishonest."}, {"id": "1554504248754425858", "text": "About 50 abortion access advocates, many wearing green, are outside the Indiana House chambers, chanting, cheering for public testimony on SB1 #AbortionBan bill they agree with. Some anti-abortion advocates here as well. @CierraReporter covering hearing inside. https://t.co/BOEcu4TqDk"}, {"id": "1554504239921127430", "text": "@TheTeazz couple are legally separated and mother obtains full custody with father given/not given visiting privileges, when mother has access to legal abortion but still chooses to have child against fathers wishes, father pays a predetermined large amount for child support in his absence"}, {"id": "1554504209348694016", "text": "Any Doctor performs sn abortion is committing MURDER and you are definitely Pro-Death Patty. Vote Smiley and gets this murderer out of both Washingtons https://t.co/mAwzPHcQza"}, {"id": "1554504195268542465", "text": "@SeanONeill1111 @uladulla @tomasocarthaigh @PatOConnor1961 @MedgibbonsCathy @Toibin1 No abortion restrictions on women for any reason for the following: 1)Not your business, 2)Not your business &amp; 3)Not your business. Until the country passes universal healthcare, which will support the health needs of children born with lifelong issues, you are only pro-birth."}, {"id": "1554504191715864577", "text": "@PinaplBoi tension from all corners of live including gender that you can cut with a knife as I personally find toxic. I stand with women and there rights especially with this new anti abortion stuff being passed, but even before that I always noticed a bit of hostility from them in our 2/3"}, {"id": "1554504167334547456", "text": "@Light_Love_Mojo If it's OK to 100% kill another human to uphold bodily autonomy, then it is definitely OK to not get vaccinated (which may or may not even affect another human) to uphold that same right. If you believe in abortion rights you must be against mandates, or you're a 100% hypocrite."}, {"id": "1554504164096577537", "text": "In @AP, @ProfMMurray examines the question of whether those who pay for out-of-state abortions could be charged as \"accomplices\" in violations of criminal law. https://t.co/vKP1UzMZL3"}, {"id": "1554504161349103617", "text": "@OscarOpossum @Pulgadas13 @davidhogg111 Bull. If they voted for gun control and in support of abortion rights the Left would be celebrating the justices -- not insulting them. Progressives are a bunch of 🤡's"}, {"id": "1554504161168953344", "text": "@NickAdamsinUSA @Jim_Jordan @SolarSystemPE You mean like abortion rights, Vet Healthcare, banning books, and voting rights?\nThat's Republicans \n\nVOTE BLUE!!"}, {"id": "1554504148049084416", "text": "@robertberens @rthompson1138 \n@therealKripke thank you\n\n https://t.co/ZfLE8LLSSp via @variety"}, {"id": "1554504130034540546", "text": "@Michelle4NM the same trouble. So abortion leads to more abortion. So, the mother who is thinking of abortion, should be helped to love, that is, to give until it hurts her plans, or her free time, to respect the life of her child.\" Mother Teresa, also known as Saint Teresa of Calcutta."}, {"id": "1554504128134610944", "text": "Dirty Dancing is playing at the downtown movie in the park tonight &amp; I'd like to know when do we all break out into abortion rights chants? I want to be ready 📣"}, {"id": "1554504127874580482", "text": "@OhhhNoItsJames1 @KatyMontgomerie @Xploshi Why don't you help further support for abortion in NI?? What are you doing? That was nothing to do with JKR was it."}, {"id": "1554504113169113089", "text": "Why the Kansas abortion amendment is so confusing https://t.co/mDmP1TH3zE via @voxdotcom \n\n#Kansas #PrimaryElection #ElectionDay #abortion #abortionaccess #ReproductiveRights #womenshealth #GOTV #vote #no"}, {"id": "1554504084857683969", "text": "On Thursday, AMwA will host a space to discuss why access to safe and legal abortion is a feminist issue. \n\nOur lineup of feminist speakers across Africa are ready and so is our moderator @Lasterbosire 🔥🔥\n\nSet your reminder now🔔\n\n#IntersectionalSRHR #SRHR4Me https://t.co/DPSllQEQ0F https://t.co/zkgFrce61a"}, {"id": "1554504074695004161", "text": "@ishprobirthsays @incompleteocean @DejaJanae3 @dianamee @BoSnerdley No you are not taking the proper historical context of Black’s and their struggles to survive in America or the people who want to eliminate them. Stop abortion just say “No”. What you are doing is pitting Mother’s against Babies. That’s just plain crazy."}, {"id": "1554504073952493570", "text": "Wearing my rbg prochoice shirt &amp; finding it hard not to sob in anger about what the deplorable Indiana gqp is doing in their abortion ban. It is antithetical to the Jewish faith to make women &amp; girls be transformed into incubators, rather than human beings."}, {"id": "1554504070529941504", "text": "Yesli Vega's leaked audio on rape and abortion. cc @IngrahamAngle @kylegriffin1 \nhttps://t.co/D9XSB7i5F9 https://t.co/ixCya7o8OY"}, {"id": "1554504060568469504", "text": "@JillFilipovic The PA law explicitly defers to the doc’s judgment. Plus abortion is legal for any reason before that point. So if you discover a health problem before the 3rd trimester you can abort without gatekeeping. That itself cuts down on the # of 3rd trimester problems."}, {"id": "1554504054528778240", "text": "For Kansans across the political spectrum, this vote is about the freedom to decide what is best for their own bodies, lives, and futures — without interference from the government. People in Kansas need to VOTE NO on this ballot initiative today!  \nhttps://t.co/pmWnEzTxbA https://t.co/Zl4Ansbws9"}, {"id": "1554504052859338753", "text": "You cannot be forced to donate blood, marrow or organs. Even after you die, your organs cannot be harvested without your explicit, written permission. \nDenying women the right to abortion means they have less bodily autonomy than a corpse.\nVOTE BLUE."}, {"id": "1554504050413953024", "text": "@amyklobuchar Not to mention,a deterrent to abortion."}, {"id": "1554504041811550210", "text": "This blatant violation of the human right to free expression is not the only restriction on abortion speech on the books in the US.\n\nSince 1981, the Siljander Amendment has prevented foreign aid funds from being used to lobby for abortion rights. https://t.co/Jvs113K87V"}, {"id": "1554504030252040192", "text": "@APatriot83 @JohnStossel @maximlott I believe I also answered this. I might volunteer if asked. And once again I will say that this question has nothing to do with abortion."}, {"id": "1554504012128555009", "text": "Uhhhh - I sure as hell would have died without my abortion.\n\nMaybe actually educate yourselves before spewing nonsense. https://t.co/hGIOFu9n33"}, {"id": "1554504001500102658", "text": "@Bobesttv @TheDemocrats There are, and have long been, active efforts to get abortion banned in practically every state, and actual bills or laws in place in more than half.\n\nThere is no such effort to ban contraception. Can you name even one?"}, {"id": "1554503998971027457", "text": "@CarneyShawn You give them abortion products, not sell them. And you don't need to report a crime to criminal cops to end that shit. Community defense bitch."}, {"id": "1554503989231816704", "text": "@marcyrw @MayraFlores2022 \"legal\" and being Federally protected as an \"unenumerated right\" are two different things. The SCOTUS ruling in Dobbs doesn't make abortion illegal; just gives power to the People (in form of their elected state reps) to decide state level legalities."}, {"id": "1554503972764979208", "text": "Fantastic piece by @beyerstein on what people and governments in blue states can do to make sure people seeking abortion can do so safe from physical or legal trauma. https://t.co/v0HAnxF4Ak"}, {"id": "1554503955341873155", "text": "Inside Kamala Harris' Campaign to Protect Abortion Rights  https://t.co/rXvUkmYq8d"}, {"id": "1554503953680941057", "text": "@GingerChin5 @Falconer084 @Pepita9000 @bdk1521 @Sitzkrieger @emrazz @SomeRando_Guy @AshleyDowd20 I’m not going to get into a debate about this, but  the Bible doesn’t speak about abortion directly, despite abortions being a part of life in Biblical times. The absence of mention is conspicuous in itself.\n\nDo not use God to justify your beliefs on abortion.\n\nNot up for debate."}, {"id": "1554503934865297411", "text": "This is actually one of the more important votes happening today. Republicans hid it in a primary day to have lower turnout and made the wording confusing because they know it isn’t popular. If Republicans fail here it’s a good bellweather for abortion around the country. https://t.co/mBfDVcfIRR"}, {"id": "1554503925931589635", "text": "New legislation from Sens. Cory Booker (D-N.J.) and Tina Smith (D-Minn.) aims to codify FDA’s superseding authority over state law regarding abortion bans. https://t.co/Mylki0IsvZ via @HuffPostPol"}, {"id": "1554503924844875778", "text": "Kansas is The First State to Put Abortion Rights on The Ballot https://t.co/pxEQD45inW"}, {"id": "1554503914434842624", "text": "States With Abortion Bans Are Among Least Supportive for Mothers and Children\nhttps://t.co/ReI3b5N2mX"}, {"id": "1554503901440667648", "text": "Significant disagreement included whether exceptions to the ban should be allowed for rape and incest victims.\n\nhttps://t.co/zRGOPtoaVi"}, {"id": "1554503895673516033", "text": "@TerryGearhart1 @nancy_annn @ChuckCjmmn “Ask” a woman to get an abortion? How about force/hound/wheedle/beg ?"}, {"id": "1554503892208996352", "text": "@DouthatNYT Abortion and birth control are none of your shitty white dude business, Ross."}, {"id": "1554503889398931457", "text": "Today, Kansans are voting on the Value Them Both Amendment. This is the first time since Roe v. Wade was overturned that a state has the opportunity to weigh in on the abortion issue. I’m on the ground talking to voters to hear their thoughts on the amendment. https://t.co/7pvblH3bv3"}, {"id": "1554503871988637697", "text": "@TheLeoTerrell She’s not getting an abortion . She can go anywhere she wants."}], "meta": {"newest_id": "1554504671380664321", "oldest_id": "1554503871988637697", "result_count": 100, "next_token": "b26v89c19zqg8o3fpz5lszhyxgs3dj9p35jrhaajugxh9"}}