{"data": [{"id": "1554968842484518914", "text": "@kizzy_edgell but have u seen dogs stung by a bee https://t.co/hDIO03818h"}, {"id": "1554968822922223618", "text": "Big Moose and dogs. Different than moose and squirrel, but just as good. https://t.co/nvbfWb2kb9"}, {"id": "1554968812767703040", "text": "「プロットmixのバディ君」岡山県 - 犬の里親募集(422018) :: ペットのおうち【月間利用者150万人！】 https://t.co/Yo2ZBQxZcp"}, {"id": "1554968812075634690", "text": "@smagula Both of our dogs are kinda shiny. https://t.co/WcpfmkZ9pN"}, {"id": "1554968799899557888", "text": "Best thing about sitting at a little French Cafe is the people watching \n\nI saw a woman gracefully drop her ice cream \n\nOverheard teens discussing weed strength \n\nLots of people training their tiny white dogs\n\nAll while practicing my French with the waiter"}, {"id": "1554968784657649667", "text": "I look at wonu once and fucking I bet on losing dogs starts playing in my head https://t.co/sFgPj66Mcr"}, {"id": "1554968777745481728", "text": "@SummaCumLoudee @limitlessmindon @MindTendencies2 Some people can't handle how others like their hot dogs. But some of us are just appreciative of a good pair of buns."}, {"id": "1554968776105492480", "text": "아키토에게 들었을지도 모르겠지만, 저는 BAD DOGS로서 노래하는 것을 그만두기로 했습니다. 아니... 내 음악은, BAD DOGS가 전부였어... 그러므로... 여기에 오는 것이 오늘로 마지막이 됩니다."}, {"id": "1554968774486491136", "text": "@_PullUpPapi Hell nah Maryland done produced enough dogs to not be in the other category with Iowa &amp; em 😂😂"}, {"id": "1554968771013611542", "text": "I’m working a double today and I miss my dogs so much it physically hurts. Cannot wait to give them all my love in 4 hours 😭"}, {"id": "1554968758124412928", "text": "Dogs available for adoption in Altoona https://t.co/zRZN2104S2"}, {"id": "1554968723555065858", "text": "Me when chapter 103 of Bungou Stray dogs came out https://t.co/L66oHsCRPv"}, {"id": "1554968716651143170", "text": "#46 Bungou Stray Dogs. Una premisa mas que interesante, me engancho bastante en su día. https://t.co/PB6EBz8wSx"}, {"id": "1554968709382512642", "text": "@MarinaPurkiss I think she thought dogs barking was the new concept"}, {"id": "1554968701350268928", "text": "Dogs like Pepper Ann are something of a rarity, much like a double rainbow or a unicorn. Unicorns don't exist, you say? Tell that to Pepper Ann! This one-in-a-million pupper has been looking for a family since late April, and it's time to @ClearTheShelter https://t.co/KnJ1pkItQw https://t.co/xMp69pAi44"}, {"id": "1554968695943958530", "text": "@mjbressler Sir. I must insist you commit the following reading to your docket: https://t.co/WXDyPfz8it"}, {"id": "1554968684015353857", "text": "ignoring the state of me but my pup trying to calm me after a panic attack  is the sweetest thing, we don’t deserve dogs https://t.co/WeuGF3r3Sk"}, {"id": "1554968676603936768", "text": "@bpdarkmarcy dogs, ayuwoki, sa and sh !!!!"}, {"id": "1554968663572168705", "text": "Chase: I'm friendly, I'm loyal, I'm energetic... I just described a dog, didn't I? \n Joseph: Well, yeah, but people love dogs"}, {"id": "1554968655904980992", "text": "Cambridge dogs Race 7 Number 7 Hillbilly Heist , Race 8 Number 8 Romantic Dancer.Christchurch Race 8 Number 1 Opawa Chrissy,Race 4 Number 1 Goldstar Larson .All the best"}], "meta": {"newest_id": "1554968842484518914", "oldest_id": "1554968655904980992", "result_count": 20, "next_token": "b26v89c19zqg8o3fpz5lt82ogxk2nl3nupb5wa0t2kvi5"}}